In [1]:
import pandas as pd
# !pip install -U pandasql
from pandasql import sqldf

In [2]:
table = pd.read_csv('table_1d83892810bc4ec79aaba7a822d72407_page_3.csv')

In [3]:
table=table.T

In [4]:
table=pd.DataFrame(table)

In [5]:
table=table[1:]

In [6]:
table=table.reset_index()

In [7]:
table

               index                        0                      1
0  Rajesh Gopinathan  Chief Executive Officer  and Managing Director
1        Rajashree R          Chief Marketing   NOT_SELECTED Officer

In [8]:
!pip install fuzzywuzzy
from fuzzywuzzy import fuzz
from fuzzywuzzy import process

Requirement already satisfied: fuzzywuzzy in c:\users\rajul\anaconda3\lib\site-packages (0.18.0)

C:\Users\rajul\anaconda3\lib\site-packages\fuzzywuzzy\fuzz.py:11: UserWarning: Using slow pure-python SequenceMatcher. Install python-Levenshtein to remove this warning
  warnings.warn('Using slow pure-python SequenceMatcher. Install python-Levenshtein to remove this warning')

In [9]:
word='who is the Chief Executive Officer'

In [10]:
for i in table.iterrows():

    x=process.extractBests(word, i)
    if(x[0][-1])>=90:
        print(x[0])
        pass

In [11]:
table.loc[0]

index          Rajesh Gopinathan
0        Chief Executive Officer
1          and Managing Director
Name: 0, dtype: object

In [12]:
#################################################

In [13]:
table2 = pd.read_csv('table_08f71301c8764c12845058c42e76556c_page_2.csv')

In [14]:
table2=table2.T
table2=pd.DataFrame(table2)
table2=table2[1:]
table2=table2.reset_index()

In [15]:
table2

,index,0,1,2,3,4
0,Keki M,Mistry,C C M I,N Chandrasekaran,Chairman,C C M N
1,N G Subramaniam,COO,M NE,Aarthi,Subramanian,SELECTED M N
2,Hanne Sorensen,,M M I,Dr Pradeep Kumar,Khosla,C M I
3,Rajesh Gopinathan,CEO & MD,M M M NE,Don Callahan,,M M I

In [16]:
table3=table2.iloc[:,-3:]
table2=table2.iloc[:,:3]

In [17]:
table3=table3.rename(columns={2:'index',3:0,4:1})

In [18]:
table2

               index         0         1
0             Keki M    Mistry   C C M I
1    N G Subramaniam       COO      M NE
2     Hanne Sorensen               M M I
3  Rajesh Gopinathan  CEO & MD  M M M NE

In [19]:
l=[table2,table3]
final_table=pd.concat(l)

In [20]:
final_table=final_table.rename(columns={0:'Position',1:'Status'})
final_table

               index     Position        Status
0             Keki M       Mistry       C C M I
1    N G Subramaniam          COO          M NE
2     Hanne Sorensen                      M M I
3  Rajesh Gopinathan     CEO & MD      M M M NE
0   N Chandrasekaran     Chairman       C C M N
1             Aarthi  Subramanian  SELECTED M N
2   Dr Pradeep Kumar       Khosla         C M I
3       Don Callahan                      M M I

In [21]:
Values={
'M':'Member',
'I':'Independent, Non-Executive Director',
'N':'Non-Independent, Non-Executive Director',
'NE':'Non-Independent, Executive Director'
}

In [22]:
for i in final_table.iterrows():

    x=process.extractBests('who is the CEO', i)
    if(x[0][-1])>=80:
        print(x[0])
        pass

(index       Rajesh Gopinathan
Position             CEO & MD
Status               M M M NE
Name: 3, dtype: object, 86)

In [23]:
# q = "SELECT * FROM final_table where 'Position' LIKE '%M%'"
# sqldf(q, globals())

In [24]:
final_table.columns

Index(['index', 'Position', 'Status'], dtype='object')

In [25]:
final_table[final_table["Status"].str.contains("M")].iloc[:,:2]

               index     Position
0             Keki M       Mistry
1    N G Subramaniam          COO
2     Hanne Sorensen
3  Rajesh Gopinathan     CEO & MD
0   N Chandrasekaran     Chairman
1             Aarthi  Subramanian
2   Dr Pradeep Kumar       Khosla
3       Don Callahan

In [26]:
final_table[final_table["Status"].str.contains("I")].iloc[:,:2]

              index Position
0            Keki M   Mistry
2    Hanne Sorensen
2  Dr Pradeep Kumar   Khosla
3      Don Callahan

In [27]:
final_table[final_table["Status"].str.contains("NE")].iloc[:,:2]

               index  Position
1    N G Subramaniam       COO
3  Rajesh Gopinathan  CEO & MD